<a href="https://colab.research.google.com/github/wolego2uni/ibm_demo/blob/main/musing_with_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
# Let's create two dummy data frames to understand
import pandas as pd

df1 = pd.DataFrame({'objects': ['A', 'B', 'C', 'D'],
                     'numbers': [3,5,9,15]})

df2 = pd.DataFrame({'cities': ['London', 'Lagos', 'Dublin', 'Dallas'],
                    'value': [14, 16,18,19]})

In [15]:
# Stacking dataframes across columns using pd.concat(axis=1)

pd.concat([df1, df2], axis=1)

  objects  numbers  cities  value
0       A        3  London     14
1       B        5   Lagos     16
2       C        9  Dublin     18
3       D       15  Dallas     19

In [18]:
# Stacking dataframes across rows using pd.concat(axis=0)

df =pd.concat([df1, df2], axis=0)
df.head()

  objects  numbers  cities  value
0       A      3.0     NaN    NaN
1       B      5.0     NaN    NaN
2       C      9.0     NaN    NaN
3       D     15.0     NaN    NaN
0     NaN      NaN  London   14.0

In [17]:
#Reordering columns
#Reordering the columns as numbers, cities, values and objects 
reorder = [1,2,3,0]
df = df[df.columns[reorder]]
df.head()

   numbers  cities  value objects
0      3.0     NaN    NaN       A
1      5.0     NaN    NaN       B
2      9.0     NaN    NaN       C
3     15.0     NaN    NaN       D
0      NaN  London   14.0     NaN